---
kind: method
id: M:Autodesk.Revit.DB.ScheduleFilter.GetElementIdValue
source: html/3ee4da28-2a21-f9a3-0b58-03286ec21bfc.htm
---
# Autodesk.Revit.DB.ScheduleFilter.GetElementIdValue Method

Gets the filter value for a filter using an ElementId value.

## Syntax (C#)
```csharp
public ElementId GetElementIdValue()
```

## Returns
The filter value.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The filter value is not an ElementId.